divDy1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         polynomial
        (
            ((0.0015 0 0)        (0 0 0))
            ((-6000 0 0)      (2 0 0))
        );
        direction        (0 0 1);
        origin           0.0005; // h0 = 1mm
// 	origin           0;
    }
    upperWall
    {
        type            noSlip;
    }
    lowerWall
    {
        type            noSlip;
    }
    frontWall
    {
        type            cyclic;
    }    
    backWall
    {
        type            cyclic;
    }
    outlet
    {
        type    	zeroGradient;
    }   
}


// ************************************************************************* //

