divDy1/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
    	type 		fixedFluxPressure;
//	type 		zeroGradient;
	value		uniform 0;
    }
    outlet
    {
	type		fixedValue;
	value		uniform 0;
    }
    frontWall
    {
        type            cyclic;
        
    }

    backWall
    {
        type            cyclic;
       
    }

    lowerWall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    upperWall
    {
        type            fixedFluxPressure;
	value		uniform 0;
    }
}

// ************************************************************************* //
