divDy1/0/alpha.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type 		inletOutlet;
	inletValue	uniform 1;
    }
    outlet
    {
	type 		inletOutlet;
	inletValue	uniform 0;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    backWall
    {
        type            cyclic;
    }

    frontWall
    {
	type		cyclic;
    }
}

// ************************************************************************* //
